References/ASTT/TestSuits/Tests/PTZ/TC.PTZ.NVT.04/TC.PTZ.NVT.04_REQ_10.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tptz="http://www.onvif.org/ver10/ptz/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <tptz:SetConfiguration>
      <tptz:PTZConfiguration token="ptzconf0">
        <tt:Name>TestName</tt:Name>
        <tt:UseCount>10</tt:UseCount>
        <tt:NodeToken>ptz0</tt:NodeToken>
        <tt:DefaultAbsolutePantTiltPositionSpace>http://www.onvif.org/ver10/tptz/PanTiltSpaces/PositionGenericSpace</tt:DefaultAbsolutePantTiltPositionSpace>
        <tt:DefaultAbsoluteZoomPositionSpace>http://www.onvif.org/ver10/tptz/ZoomSpaces/PositionGenericSpace</tt:DefaultAbsoluteZoomPositionSpace>
        <tt:DefaultRelativeZoomTranslationSpace>http://uri1</tt:DefaultRelativeZoomTranslationSpace>
        <tt:DefaultContinuousPanTiltVelocitySpace>http://www.onvif.org/ver10/tptz/PanTiltSpaces/VelocityGenericSpace</tt:DefaultContinuousPanTiltVelocitySpace>
        <tt:DefaultContinuousZoomVelocitySpace>http://www.onvif.org/ver10/tptz/ZoomSpaces/VelocityGenericSpace</tt:DefaultContinuousZoomVelocitySpace>
        <tt:DefaultPTZTimeout>PT0.3S</tt:DefaultPTZTimeout>
      </tptz:PTZConfiguration>
      <tptz:ForcePersistence>true</tptz:ForcePersistence>
    </tptz:SetConfiguration>
  </s:Body>
</s:Envelope>